In [10]:
#1- Data_preprocesing

import pandas as pd
df = pd.read_csv("titanic-passengers (1).csv")
df.head()
df.isnull().sum()
#replacing missing numerical values
df['Age'].fillna(df['Age'].mean() , inplace=True)
#replacing missing categorical values
number_of_elements = len(df['Cabin'])
print('number of elements : ' , number_of_elements)
print(df["Cabin"].value_counts())
df["Cabin"].fillna('G6' , inplace = True)
number_of_elements = len(df['Embarked'])
print('number of elements: ' ,number_of_elements)
print(df['Embarked'].value_counts())
df['Embarked'].fillna('S' , inplace = True)
df.isnull().sum()
df.info()
df['Cabin'].values
# Transform from Categorical to Numerical
from sklearn.preprocessing import LabelEncoder
#Name
encoder = LabelEncoder()
df['Name']=encoder.fit_transform(df['Name'])
#Sex
encoder = LabelEncoder()
df['Sex']=encoder.fit_transform(df['Sex'])
#Ticket
encoder = LabelEncoder()
df['Ticket']=encoder.fit_transform(df['Ticket'])
#Cabin
encoder = LabelEncoder()
df['Cabin']=encoder.fit_transform(df['Cabin'])
#Embarked
encoder = LabelEncoder()
df['Embarked']=encoder.fit_transform(df['Embarked'])
df

number of elements :  891
B96 B98        4
G6             4
C23 C25 C27    4
F33            3
E101           3
              ..
E36            1
C106           1
E10            1
D10 D12        1
E77            1
Name: Cabin, Length: 147, dtype: int64
number of elements:  891
S    644
C    168
Q     77
Name: Embarked, dtype: int64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,108,1,22.000000,1,0,523,7.2500,145,2
1,2,1,1,190,0,38.000000,1,0,596,71.2833,81,0
2,3,1,3,353,0,26.000000,0,0,669,7.9250,145,2
3,4,1,1,272,0,35.000000,1,0,49,53.1000,55,2
4,5,0,3,15,1,35.000000,0,0,472,8.0500,145,2
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,548,1,27.000000,0,0,101,13.0000,145,2
887,888,1,1,303,0,19.000000,0,0,14,30.0000,30,2
888,889,0,3,413,0,29.699118,1,2,675,23.4500,145,2
889,890,1,1,81,1,26.000000,0,0,8,30.0000,60,0
890,891,0,3,220,1,32.000000,0,0,466,7.7500,145,1

In [ ]:
#2- Data_visualisation